{"department": "Department of Mechanical Engineering", "name": "MCL781 Machining Processes and Analysis", "description": "Introduction to basic traditional machining processes – the need and requirements for such processes and their brief application areas. Specifications and geometry of various cutting tools such as turning tools, drills, milling cutters in different referencing systems such as work reference, tool reference and machine reference systems. Methods and techniques used for sharpening / resharpening of these cutting tools.\n\nMechanisms of chip formation by single point, drilling and milling tools. Different types of chips obtained during machining. Concept of effective rake angle during machining.\n\nMechanics of machining of single point cutting tool, drill and milling cutter – estimation of cutting forces using analytical models, Experimental methods and instruments used for cutting force determination during machining processes, essential design features of the dynamometers used for such measurement.\n\nHeat transfer during machining processes, identification of the different sources of heat generation and development of suitable models for analytical estimation of the cutting temperature, Experimental methods used for estimating cutting temperature.\n\nUse of cutting fluids in machining – purposes, proper selection and methods of application of such cutting fluids.\n\nAdvanced cutting tool materials and processes used for development of such tools.\n\nMechanics of cutting tool wear and development of models for assessing the tool life.\n\nEconomics of machining – identifying the major parameters in machining and their roles on cutting force, surface finish and cutting temperature, selection of optimal conditions of process parameters to reduce machining costs through suitable models.\n\nIntroduction to Grinding processes and understanding of the differences between machining and grinding.\n\nGrinding for bulk material removal – creep feed grinding – fast feed grinding.\n\nSuperabrasive grinding wheels – both monolayer and multilayer, advantages of the monolayer wheel and its applications.\n\nGrinding Geometry and Kinematics – contact length – measurement of contact length definition of active grits and methods used for estimating active grits, use of single grit experiments to develop models for estimating forces and specific energy requirement in grinding.\n\nWheel Conditioning – truing and dressing techniques and parameters – effect of dressing on grinding wheel parameters – dressing of super-abrasive wheels.\n\nTemperature generation during grinding process and thermal modelling of the process.\n\nThermal damages in grinding – burning – oxidation – tempering – residual stresses – effect of residual stresses on job quality\n- measurement of residual stresses – introduction to X-ray diffractometry – XRD measurement of residual stress – application of Barkhausen Noise Technique in grinding.\n\nSpecial Machining and grinding processes such as • Ductile Regime Grinding • Diamond Turning.", "credits": "4 (3-0-2)"}